## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| update | `module.url_shortener_lambda.aws_iam_policy.policies[0]` |
| add    | `aws_ssm_parameter.auth_token_app`                       |
|        | `aws_ssm_parameter.auth_token_notify`                    |
| delete | `aws_ssm_parameter.api_auth_token`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener/index/emailIndex",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_api_key",
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_ssm_parameter.api_auth_token will be destroyed
  # (because aws_ssm_parameter.api_auth_token is not in configuration)
  - resource "aws_ssm_parameter" "api_auth_token" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "api_auth_token" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "api_auth_token" -> null
      - tags            = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 5 -> null
    }

  # aws_ssm_parameter.auth_token_app will be created
  + resource "aws_ssm_parameter" "auth_token_app" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "auth_token_app"
      + tags           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.auth_token_notify will be created
  + resource "aws_ssm_parameter" "auth_token_notify" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "auth_token_notify"
      + tags           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.url_shortener_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::843973686572:policy/url-shortener-api-0"
        name      = "url-shortener-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener/index/emailIndex",
                          - "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_api_key",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
